english/vocabulary.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil
#+TAGS: AWL(a)

Record my english study process.
1. C represent less 1000 occur on youtube

* high
:PROPERTIES:
:EXPORT_FILE_NAME: high.md
:END:
高，也很高兴的
#+begin_notes
不能用来描述人、动物，要使用tall
#+end_notes
** 语义
*** 高
The camp was surrounded by a high fence.
*** 高的
The apartment had spacious rooms with high ceilings.
*** 超乎寻常的
Temperatures remained high for the rest of the week.
*** 先进的
We can offer all the benefits of the latest high technology.
*** 高兴的
I was still high from the *applause*.
*** 高高地
He kicked the ball high into the air, over the heads of the crowd.
*** 高音调地
A strange cry rang high into the night.
*** 高的成就
My parents always encouraged me to aim high.
*** 最高点
Hights of 40C were recorded in the region last summer.
*** 高中的缩略
Benjamin Franklin High
** 短语

*** high office
Both of them held high office in the Anglican Church.

https://youglish.com/getbyid/24927471/high%20office/english
*** high opinion
I've always had a high opinion of her work.

https://youglish.com/getbyid/124062062/high%20opinion/english
*** hold in high esteem
As an educationalist, he was held in very high esteem.

https://youglish.com/getbyid/4533171/hold%20in%20high%20esteem/english
*** it is high time
It's high time you got a job.

https://youglish.com/getbyid/48427461/it%20is%20high%20time/english
*** high life
We're all stuck here, while he's off living the high life in New York.

https://youglish.com/getbyid/19799480/high%20life/english
*** on a high note
The team finished their tour on a high note in Barbados.

https://youglish.com/getbyid/131057517/on%20a%20high%20note/english
*** high and mighty
Don't get high and mighty with me.

https://youglish.com/getbyid/4948367/high%20and%20mighty/english
*** get on your high horse
If she'd get down off her high horse for a moment, she might realize there's more than one point of view here.

https://youglish.com/getbyid/61636648/get%20on%20your%20high%20horse/english
*** high and dry
The once-thriving port of Rye was left high and dry as sea levels retreated.

https://youglish.com/getbyid/7325651/high%20and%20dry/english
*** look high and low
We looked high and low for Sandy but couldn't find her.

https://youglish.com/getbyid/2594088/look%20high%20and%20low/english
*** be on a high
They're bound to be on a high after such an incredible victory.

https://youglish.com/getbyid/11096410/be%20on%20a%20high/english
*** from on high
An order came from on high.

https://youglish.com/getbyid/15207586/from%20on%20high/english
*** on high
Microwave on high for eight minutes.

https://youglish.com/getbyid/148969560/on%20high/english
